tardate/LittleArduinoProjects/ARM/STM32U3/STM32U385RGDevBoard/blinky/Core/Inc/stm32u3xx_hal_conf.h
#if !defined  (MSIRC1_VALUE)
  #define MSIRC1_VALUE                              24000000U   /*!< Value of the Internal MSI RC1 oscillator in Hz.
                                                               The real value may vary depending on the variations in
                                                               voltage and temperature. */
#endif /* MSIRC1_VALUE */

/**
  * @brief External clock source for SAI1 peripheral
  *        This value is used by the RCC HAL module to compute the SAI1 & SAI2 clock source
  *        frequency.
  */
#if !defined  (EXTERNAL_SAI1_CLOCK_VALUE)
  #define EXTERNAL_SAI1_CLOCK_VALUE    48000UL /*!< Value of the SAI1 External clock source in Hz*/
#endif /* EXTERNAL_SAI1_CLOCK_VALUE */

/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
  * @brief This is the HAL system configuration section
  */

#define  VDD_VALUE                    3300UL /*!< Value of VDD in mv */
#define  TICK_INT_PRIORITY            (15UL)  /*!< tick interrupt priority (lowest by default) */
#define  USE_RTOS                     0U
#define  PREFETCH_ENABLE              1U                    /*!< Enable prefetch */

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the
  *        HAL drivers code
  */

/* #define USE_FULL_ASSERT    1U */

/* ################## Register callback feature configuration ############### */
/**
  * @brief Set below the peripheral configuration  to "1U" to add the support
  *        of HAL callback registration/unregistration feature for the HAL
  *        driver(s). This allows user application to provide specific callback
  *        functions thanks to HAL_PPP_RegisterCallback() rather than overwriting
  *        the default weak callback functions (see each stm32u3xx_hal_ppp.h file
  *        for possible callback identifiers defined in HAL_PPP_CallbackIDTypeDef
  *        for each PPP peripheral).
  */
#define  USE_HAL_ADC_REGISTER_CALLBACKS           0U /* ADC register callback disabled       */
#define  USE_HAL_CCB_REGISTER_CALLBACKS           0U /* CCB register callback disabled       */
#define  USE_HAL_COMP_REGISTER_CALLBACKS          0U /* COMP register callback disabled      */
#define  USE_HAL_CORTEX_REGISTER_CALLBACKS        0U /* CORTEX register callback disabled    */
#define  USE_HAL_CRC_REGISTER_CALLBACKS           0U /* CRC register callback disabled       */
#define  USE_HAL_CRYP_REGISTER_CALLBACKS          0U /* CRYP register callback disabled      */
#define  USE_HAL_DAC_REGISTER_CALLBACKS           0U /* DAC register callback disabled       */
#define  USE_HAL_DMA_REGISTER_CALLBACKS           0U /* DMA register callback disabled       */
#define  USE_HAL_EXTI_REGISTER_CALLBACKS          0U /* EXTI register callback disabled      */
#define  USE_HAL_FDCAN_REGISTER_CALLBACKS         0U /* FDCAN register callback disabled     */
#define  USE_HAL_FLASH_REGISTER_CALLBACKS         0U /* FLASH register callback disabled     */
#define  USE_HAL_GPIO_REGISTER_CALLBACKS          0U /* GPIO register callback disabled      */
#define  USE_HAL_GTZC_REGISTER_CALLBACKS          0U /* GTZC register callback disabled      */
#define  USE_HAL_HASH_REGISTER_CALLBACKS          0U /* HASH register callback disabled      */
#define  USE_HAL_HCD_REGISTER_CALLBACKS           0U /* HCD register callback disabled       */
#define  USE_HAL_I2C_REGISTER_CALLBACKS           0U /* I2C register callback disabled       */
#define  USE_HAL_I3C_REGISTER_CALLBACKS           0U /* I3C register callback disabled       */
#define  USE_HAL_ICACHE_REGISTER_CALLBACKS        0U /* ICACHE register callback disabled    */
#define  USE_HAL_IRDA_REGISTER_CALLBACKS          0U /* IRDA register callback disabled      */
#define  USE_HAL_IWDG_REGISTER_CALLBACKS          0U /* IWDG register callback disabled      */
#define  USE_HAL_LPTIM_REGISTER_CALLBACKS         0U /* LPTIM register callback disabled     */
#define  USE_HAL_MDF_REGISTER_CALLBACKS           0U /* MDF register callback disabled       */
#define  USE_HAL_MMC_REGISTER_CALLBACKS           0U /* MMC register callback disabled       */
#define  USE_HAL_OPAMP_REGISTER_CALLBACKS         0U /* OPAMP register callback disabled     */
#define  USE_HAL_PCD_REGISTER_CALLBACKS           0U /* PCD register callback disabled       */
#define  USE_HAL_PKA_REGISTER_CALLBACKS           0U /* PKA register callback disabled       */
#define  USE_HAL_PWR_REGISTER_CALLBACKS           0U /* PWR register callback disabled       */
#define  USE_HAL_RAMCFG_REGISTER_CALLBACKS        0U /* RAMCFG register callback disabled    */
#define  USE_HAL_RCC_REGISTER_CALLBACKS           0U /* RCC register callback disabled       */
#define  USE_HAL_RNG_REGISTER_CALLBACKS           0U /* RNG register callback disabled       */
#define  USE_HAL_RTC_REGISTER_CALLBACKS           0U /* RTC register callback disabled       */
#define  USE_HAL_SAI_REGISTER_CALLBACKS           0U /* SAI register callback disabled       */
#define  USE_HAL_SD_REGISTER_CALLBACKS            0U /* SD register callback disabled        */
#define  USE_HAL_SMARTCARD_REGISTER_CALLBACKS     0U /* SMARTCARD register callback disabled */
#define  USE_HAL_SMBUS_REGISTER_CALLBACKS         0U /* SMBUS register callback disabled     */
#define  USE_HAL_SPI_REGISTER_CALLBACKS           0U /* SPI register callback disabled       */
#define  USE_HAL_TIM_REGISTER_CALLBACKS           0U /* TIM register callback disabled       */
#define  USE_HAL_TSC_REGISTER_CALLBACKS           0U /* TSC register callback disabled       */
#define  USE_HAL_UART_REGISTER_CALLBACKS          0U /* UART register callback disabled      */
#define  USE_HAL_USART_REGISTER_CALLBACKS         0U /* USART register callback disabled     */
#define  USE_HAL_WWDG_REGISTER_CALLBACKS          0U /* WWDG register callback disabled      */
#define  USE_HAL_XSPI_REGISTER_CALLBACKS          0U /* XSPI register callback disabled      */

/* ################## SPI peripheral configuration ########################## */

/* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
 * Activated: CRC code is present inside driver
 * Deactivated: CRC code cleaned from driver
 */
#define USE_SPI_CRC                   0U

/* ################## SDMMC peripheral configuration ######################### */

#define USE_SD_TRANSCEIVER           0U

/* Includes ------------------------------------------------------------------*/
/**
  * @brief Include module's header file
  */
#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32u3xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32u3xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32u3xx_hal_dma.h"
#endif /* HAL_DMA_MODULE_ENABLED */

